#+STARTUP: show2levels
#+PROPERTY: header-args:sh :results output table replace :noweb yes :wrap org
#+TODO: XPS(x) AIR(a) PRO(p) | SYNCED(s)
* changelog
** todo states

with the cursor on a header set a todo

#+begin_example
C-c C-t
#+end_example

+ x = xps changes only on dell xps
+ a = air changes pulled on macbook air
+ p = pro changes pulled on macbook pro
+ s = synced

space clears the todo state

** noweb code block

pass in the var path and use eval echo path to expand it

#+NAME: noweb-block
#+begin_src sh 
expanded_path=$(eval echo "${path}") # Force shell expansion
git -C "${expanded_path}" log --pretty=format:'%h, %s, %cd, "%D"' -10 --date=format:'%H:%M:%S/%d-%m-%Y' 
#+end_src

** XPS cerberus

github url

[[https://github.com/NapoleonWils0n/cerberus]]

local git repo

#+begin_src sh
~/git/cerberus
#+end_src

git status

#+NAME: cerberus
#+HEADER: :var path="~/git/cerberus"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: cerberus
#+begin_org
| e91b71f2 | sh                                                 | 15:35:28/20-06-2025 | HEAD -> master, github/master, github/HEAD |
| acf825a8 | quote                                              | 15:29:17/20-06-2025 |                                            |
| cf07e994 | quote                                              | 15:27:54/20-06-2025 |                                            |
| ac6fc647 | test                                               | 15:25:05/20-06-2025 |                                            |
| 505ecdbb | nixos system flake garbage collection              | 15:11:26/20-06-2025 |                                            |
| dbc3cbec | whisper                                            | 18:55:22/19-06-2025 |                                            |
| 2a63b670 | git                                                | 18:54:39/18-06-2025 |                                            |
| 862d33be | git                                                | 18:53:24/18-06-2025 |                                            |
| 8f452ffd | lrsha show sha sums for local and remote git repos | 23:00:38/17-06-2025 |                                            |
| 46ebdca0 | git compare local and remote sha sum               | 22:21:56/17-06-2025 |                                            |
#+end_org




